<a href="https://colab.research.google.com/github/prithwis/KKolab/blob/main/KK_A1_MySQL_Local_Shell_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>



![alt text](https://4.bp.blogspot.com/-gbL5nZDkpFQ/XScFYwoTEII/AAAAAAAAAGY/CcVb_HDLwvs2Brv5T4vSsUcz7O4r2Q79ACK4BGAYYCw/s1600/kk3-header00-beta.png)<br>


<hr>

[Prithwis Mukerjee](http://www.yantrajaal.com)<br>

## Purpose
This Colab Notebook demonstrates how to 


1.   Install MySQL inside the VM
2.   Access MySQL from the mysql client
3.   Access MySQL from Python with Pandas 
<hr>
Last Updated : 20 Aug 2021

#Install & Test Connectivity

In [1]:
!apt-get update > null
!apt-get -y install mysql-server > null

E: Sub-process /usr/bin/dpkg returned an error code (1)

In [2]:
!/etc/init.d/mysql restart

 * Stopping MySQL database server mysqld
   ...done.
 * Starting MySQL database server mysqld
No directory, logging in with HOME=/
   ...done.

In [3]:
!mysql --version

mysql  Ver 14.14 Distrib 5.7.35, for Linux (x86_64) using  EditLine wrapper

In [4]:
!mysql -e 'create database praxisDB'

In [5]:
!mysql -e 'show databases'

+--------------------+
| Database           |
+--------------------+
| information_schema |
| mysql              |
| performance_schema |
| praxisDB           |
| sys                |
+--------------------+

#Create Table & Load Data

### Test Data <br>

dept.csv https://drive.google.com/open?id=1rJu1oUgUsShEG9Hh8IG0-55tAisfYBCc

emp.csv https://drive.google.com/open?id=136ZpigRZKG3T-9wEBjD7r6P94y9gCWeU

In [6]:
# The CSV files are stored in the author's Google Drive
!gdown https://drive.google.com/uc?id=1rJu1oUgUsShEG9Hh8IG0-55tAisfYBCc
!gdown https://drive.google.com/uc?id=136ZpigRZKG3T-9wEBjD7r6P94y9gCWeU

Downloading...
From: https://drive.google.com/uc?id=1rJu1oUgUsShEG9Hh8IG0-55tAisfYBCc
To: /content/dept.csv
100% 148/148 [00:00<00:00, 244kB/s]
Downloading...
From: https://drive.google.com/uc?id=136ZpigRZKG3T-9wEBjD7r6P94y9gCWeU
To: /content/emp.csv
100% 734/734 [00:00<00:00, 1.36MB/s]

In [7]:
!ls

dept.csv  emp.csv  null  sample_data

In [8]:
!mysql praxisDB -e 'drop table empl'
!mysql praxisDB -e 'create table empl (empid char(6),lastname varchar(20), firstname varchar(20), jobdesc varchar(10), joindate date, salary int, comm decimal(3,2), deptid char(2));'
!mysql praxisDB -e 'drop table dept'
!mysql praxisDB -e 'create table dept (deptid char(2),deptname varchar(20), managerid char(6), location varchar(10));'

ERROR 1051 (42S02) at line 1: Unknown table 'praxisDB.empl'
ERROR 1051 (42S02) at line 1: Unknown table 'praxisDB.dept'

In [9]:
!mysql praxisDB -e 'desc empl'

+-----------+--------------+------+-----+---------+-------+
| Field     | Type         | Null | Key | Default | Extra |
+-----------+--------------+------+-----+---------+-------+
| empid     | char(6)      | YES  |     | NULL    |       |
| lastname  | varchar(20)  | YES  |     | NULL    |       |
| firstname | varchar(20)  | YES  |     | NULL    |       |
| jobdesc   | varchar(10)  | YES  |     | NULL    |       |
| joindate  | date         | YES  |     | NULL    |       |
| salary    | int(11)      | YES  |     | NULL    |       |
| comm      | decimal(3,2) | YES  |     | NULL    |       |
| deptid    | char(2)      | YES  |     | NULL    |       |
+-----------+--------------+------+-----+---------+-------+

In [10]:
!mysql praxisDB -e 'desc dept'

+-----------+-------------+------+-----+---------+-------+
| Field     | Type        | Null | Key | Default | Extra |
+-----------+-------------+------+-----+---------+-------+
| deptid    | char(2)     | YES  |     | NULL    |       |
| deptname  | varchar(20) | YES  |     | NULL    |       |
| managerid | char(6)     | YES  |     | NULL    |       |
| location  | varchar(10) | YES  |     | NULL    |       |
+-----------+-------------+------+-----+---------+-------+

In [11]:
#quick SQL reference https://gist.github.com/hofmannsven/9164408
!mysql praxisDB -e "LOAD DATA LOCAL INFILE 'emp.csv' INTO TABLE empl FIELDS TERMINATED BY ',' IGNORE 1 LINES;"

In [12]:
#!cat dept.csv
!mysql praxisDB -e "LOAD DATA LOCAL INFILE 'dept.csv' INTO TABLE dept FIELDS TERMINATED BY ',' LINES TERMINATED BY '\r\n'  IGNORE 1 LINES;"

#Retrieve Data

In [13]:
!mysql praxisDB -e 'select * from empl'

+--------+-------------+-----------+------------+------------+--------+------+--------+
| empid  | lastname    | firstname | jobdesc    | joindate   | salary | comm | deptid |
+--------+-------------+-----------+------------+------------+--------+------+--------+
| 742866 | Bacchan     | Amitabh   | Executive  | 2003-03-10 |  50000 | 0.10 | 10     |
| 349870 | Mukherjee   | Rani      | Manager    | 2005-05-04 |  25000 | 0.06 | 40     |
| 865477 | Dikshit     | Madhuri   | Clerk      | 2002-04-04 |  10000 | 0.02 | 20     |
| 239456 | Khan        | Shahrukh  | Manager    | 2004-01-03 |  30000 | 0.07 | 20     |
| 897889 | Sehwag      | Virender  | Cus_Rep    | 2005-01-02 |  15000 | 0.05 | 20     |
| 123980 | Dhoni       | Mahender  | Clerk      | 2004-10-09 |   9000 | 0.02 | 40     |
| 822134 | Dravid      | Rahul     | Sr Manager | 2000-06-04 |  40000 | 0.08 | 30     |
| 997445 | Dalmia      | Jagmohan  | Clerk      | 2001-07-01 |  12000 | 0.02 | 30     |
| 989007 | Ganguly     | Sourav    | Cus_Rep    | 2002-01-01 |  20000 | 0.03 | 40     |
| 299034 | Ganesan     | Rekha     | Director   | 2002-10-10 |  60000 | 0.11 | 10     |
| 546223 | Karthikeyan | Narayan   | Secretary  | 2005-12-04 |  40000 | 0.09 | 10     |
| 223112 | Mirza       | Sania     | Cus_Rep    | 2001-11-19 |  25000 | 0.04 | 30     |
+--------+-------------+-----------+------------+------------+--------+------+--------+

In [14]:
!mysql praxisDB -e 'select * from dept'

+--------+------------+-----------+----------+
| deptid | deptname   | managerid | location |
+--------+------------+-----------+----------+
| 10     | Corporate  | 299034    | Calcutta |
| 20     | Sales      | 239456    | Calcutta |
| 30     | Accounts   | 822134    | Calcutta |
| 40     | Production | 349870    | Bombay   |
+--------+------------+-----------+----------+

In [15]:
!mysql praxisDB -e 'select lastname, firstname, location from empl, dept where empl.deptid = dept.deptid'

+-------------+-----------+----------+
| lastname    | firstname | location |
+-------------+-----------+----------+
| Bacchan     | Amitabh   | Calcutta |
| Mukherjee   | Rani      | Bombay   |
| Dikshit     | Madhuri   | Calcutta |
| Khan        | Shahrukh  | Calcutta |
| Sehwag      | Virender  | Calcutta |
| Dhoni       | Mahender  | Bombay   |
| Dravid      | Rahul     | Calcutta |
| Dalmia      | Jagmohan  | Calcutta |
| Ganguly     | Sourav    | Bombay   |
| Ganesan     | Rekha     | Calcutta |
| Karthikeyan | Narayan   | Calcutta |
| Mirza       | Sania     | Calcutta |
+-------------+-----------+----------+

#Python with Pandas

## Panda Modules

In [16]:
!apt install libmysqlclient-dev 
!pip install mysqlclient 
import pandas as pd
import MySQLdb

Reading package lists... Done
Building dependency tree
Reading state information... Done
libmysqlclient-dev is already the newest version (5.7.35-0ubuntu0.18.04.1).
libmysqlclient-dev set to manually installed.
The following package was automatically installed and is no longer required:
  libnvidia-common-460
Use 'apt autoremove' to remove it.
0 upgraded, 0 newly installed, 0 to remove and 50 not upgraded.
2 not fully installed or removed.
After this operation, 0 B of additional disk space will be used.
Setting up mysql-server-5.7 (5.7.35-0ubuntu0.18.04.1) ...
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of stop.
Renaming removed key_buffer and myisam-recover options (if present)
/var/lib/mysql/ibdata1:  2737
ERROR: Database files are locked. Daemon already running?
Warning: Unable to start the server. Please restart MySQL and run mysql_upgrade to ensure the database is ready for use.
/var/lib/mysql/ibdata1:  2737
ERROR: Database files are locked. Daemon already running?
Warning: Unable to start the server.
Created symlink /etc/systemd/system/multi-user.target.wants/mysql.service → /lib/systemd/system/mysql.service.
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up mysql-server (5.7.35-0ubuntu0.18.04.1) ...
W: APT had planned for dpkg to do more than it reported back (3 vs 7).
   Affected packages: mysql-server-5.7:amd64
Collecting mysqlclient
  Downloading mysqlclient-2.0.3.tar.gz (88 kB)
     |████████████████████████████████| 88 kB 3.3 MB/s
Building wheels for collected packages: mysqlclient
  Building wheel for mysqlclient (setup.py) ... done
  Created wheel for mysqlclient: filename=mysqlclient-2.0.3-cp37-cp37m-linux_x86_64.whl size=100141 sha256=c3ac1c7734e0884f507966573f1c1d3e47af3b864a32698adb545d734bcefc4e
  Stored in directory: /root/.cache/pip/wheels/79/1c/f8/11fafab45fe6696eea63794a5d747b9c6b54990ac6f1885fb7
Successfully built mysqlclient
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.0.3

In [18]:
DBConn = MySQLdb.connect(db='praxisDB')
#df_mysql = pd.read_sql('select * from emp2;', con=con_mysql)  
df_mysql = pd.read_sql('show tables', con=DBConn)    
print ('loaded dataframe from MySQL. records:', len(df_mysql))
DBConn.close()

loaded dataframe from MySQL. records: 2

In [19]:
df_mysql

  Tables_in_praxisDB
0               dept
1               empl

## Pandas Functions

In [20]:
#To run any non-SELECT SQL command
def runCMD (DDL):
    DBConn= MySQLdb.connect(db='praxisDB')
    myCursor = DBConn.cursor()
    retcode = myCursor.execute(DDL) 
    print (retcode)
    DBConn.commit()
    DBConn.close()

#To run any SELECT SQL command
def runSELECT (CMD):
    DBConn= MySQLdb.connect(db='praxisDB')
    df_mysql = pd.read_sql(CMD, con=DBConn)    
    DBConn.close()
    return df_mysql

#Operations with Python

In [21]:
runCMD("DROP TABLE IF EXISTS Emp;")
runCMD("CREATE TABLE IF NOT EXISTS Emp ( \
  EmpID char(6)  NOT NULL, \
  LastName varchar(50) , \
  FirstName varchar(50) , \
  JobDesc varchar(50) , \
  JoinDate date NOT NULL, \
  Salary int(11) , \
  Comm float , \
  DeptID char(2) \
) ;")

0
0

In [22]:
runCMD("INSERT INTO Emp (EmpID, LastName, FirstName, JobDesc, JoinDate, Salary, Comm, DeptID) \
    VALUES \
	('742866', 'Bacchan', 'Amitabh', 'Executive', '2003-03-10', 50000, 0.1, '10'), \
	('349870', 'Mukherjee', 'Rani', 'Manager', '2005-05-04', 25000, 0.06, '40'), \
	('865477', 'Dikshit', 'Madhuri', 'Clerk', '2002-04-04', 10000, 0.02, '20'), \
	('239456', 'Khan', 'Shahrukh', 'Manager', '2004-01-03', 30000, 0.07, '20'), \
	('897889', 'Sehwag', 'Virender', 'Cus_Rep', '2005-01-02', 15000, 0.05, '20'), \
	('123980', 'Dhoni', 'Mahender', 'Clerk', '2004-10-09', 9000, 0.02, '40'), \
	('822134', 'Dravid', 'Rahul', 'Sr Manager', '2000-06-04', 40000, 0.08, '30'), \
	('997445', 'Dalmia', 'Jagmohan', 'Clerk', '2001-07-01', 12000, 0.02, '30'), \
	('989007', 'Ganguly', 'Sourav', 'Cus_Rep', '2002-01-01', 20000, 0.03, '40'), \
	('299034', 'Ganesan', 'Rekha', 'Director', '2002-10-10', 60000, 0.11, '10'), \
	('546223', 'Karthikeyan', 'Narayan', 'Secretary', '2005-12-04', 40000, 0.09, '10'), \
	('223112', 'Mirza', 'Sania', 'Cus_Rep', '2001-11-19', 25000, 0.04, '30');"
    )

12

In [23]:
runCMD("DROP TABLE IF EXISTS Dept;")
runCMD("CREATE TABLE Dept ( \
  DeptID char(2)  NOT NULL, \
  DeptName varchar(50) , \
  ManagerID char(6) , \
  Location varchar(50) \
 );")

0
0

In [24]:
runCMD("INSERT INTO Dept (DeptID, DeptName, ManagerID, Location) VALUES \
	('10', 'Corporate', '299034', 'Calcutta'), \
	('20', 'Sales', '239456', 'Calcutta'), \
	('30', 'Accounts', '822134', 'Calcutta'), \
	('40', 'Production', '349870', 'Bombay');")

4

In [25]:
runSELECT('Select * from Emp;')

     EmpID     LastName FirstName     JobDesc    JoinDate  Salary  Comm DeptID
0   742866      Bacchan   Amitabh   Executive  2003-03-10   50000  0.10     10
1   349870    Mukherjee      Rani     Manager  2005-05-04   25000  0.06     40
2   865477      Dikshit   Madhuri       Clerk  2002-04-04   10000  0.02     20
3   239456         Khan  Shahrukh     Manager  2004-01-03   30000  0.07     20
4   897889       Sehwag  Virender     Cus_Rep  2005-01-02   15000  0.05     20
5   123980        Dhoni  Mahender       Clerk  2004-10-09    9000  0.02     40
6   822134       Dravid     Rahul  Sr Manager  2000-06-04   40000  0.08     30
7   997445       Dalmia  Jagmohan       Clerk  2001-07-01   12000  0.02     30
8   989007      Ganguly    Sourav     Cus_Rep  2002-01-01   20000  0.03     40
9   299034      Ganesan     Rekha    Director  2002-10-10   60000  0.11     10
10  546223  Karthikeyan   Narayan   Secretary  2005-12-04   40000  0.09     10
11  223112        Mirza     Sania     Cus_Rep  2001-11-19   25000  0.04     30

In [26]:
runSELECT('Select * from Dept;')

  DeptID    DeptName ManagerID  Location
0     10   Corporate    299034  Calcutta
1     20       Sales    239456  Calcutta
2     30    Accounts    822134  Calcutta
3     40  Production    349870    Bombay

In [27]:
DBConn = MySQLdb.connect(db='praxisDB')
#df_mysql = pd.read_sql('select * from emp2;', con=con_mysql)  
pd.read_sql('show tables', con=DBConn)    
#print ('loaded dataframe from MySQL. records:', len(df_mysql))
#DBConn.close()

  Tables_in_praxisDB
0               Dept
1                Emp
2               dept
3               empl

#Chronobooks <br>
![alt text](https://1.bp.blogspot.com/-lTiYBkU2qbU/X1er__fvnkI/AAAAAAAAjtE/GhDR3OEGJr4NG43fZPodrQD5kbxtnKebgCLcBGAsYHQ/s600/Footer2020-600x200.png)<hr>
Chronotantra and Chronoyantra are two science fiction novels that explore the collapse of human civilisation on Earth and then its rebirth and reincarnation both on Earth as well as on the distant worlds of Mars, Titan and Enceladus. But is it the human civilisation that is being reborn? Or is it some other sentience that is revealing itself. 
If you have an interest in AI and found this material useful, you may consider buying these novels, in paperback or kindle, from [http://bit.ly/chronobooks](http://bit.ly/chronobooks)